yul78/STM32H723ZGT6_ROV/MDK-ARM/.pack/Keil/STM32H7xx_DFP.4.1.0/CMSIS/SVD/STM32H7B3.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BDMA1</name>
      <description>Basic direct memory access controller</description>
      <groupName>BDMA</groupName>
      <baseAddress>0x48022C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>      
      <interrupt>
        <name>BDMA2_CH0</name>
        <description>BDMA2 channel 0 interrupt</description>
        <value>129</value>
      </interrupt>
      <interrupt>
        <name>BDMA2_CH1</name>
        <description>BDMA2 channel 1 interrupt</description>
        <value>130</value>
      </interrupt>
      <interrupt>
        <name>BDMA2_CH2</name>
        <description>BDMA2 channel 2 interrupt</description>
        <value>131</value>
      </interrupt>
      <interrupt>
        <name>BDMA2_CH3</name>
        <description>BDMA2 channel 3 interrupt</description>
        <value>132</value>
      </interrupt>
      <interrupt>
        <name>BDMA2_CH4</name>
        <description>BDMA2 channel 4 interrupt</description>
        <value>133</value>
      </interrupt>
      <interrupt>
        <name>BDMA2_CH5</name>
        <description>BDMA2 channel 5 interrupt</description>
        <value>134</value>
      </interrupt>
      <interrupt>
        <name>BDMA_CH6</name>
        <description>BDMA channel 6 interrupt</description>
        <value>135</value>
      </interrupt>
      <interrupt>
        <name>BDMA1_CH7</name>
        <description>BDMA1 global interrupt</description>
        <value>136</value>
      </interrupt>
      <interrupt>
        <name>BDMA1</name>
        <description>BDMA1</description>
        <value>154</value>
      </interrupt>   
      <registers>
        <register>
          <name>BDMA_ISR</name>
          <displayName>BDMA_ISR</displayName>
          <description>DMA interrupt status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GIF1</name>
              <description>Channel x global interrupt flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIF1</name>
              <description>Channel x transfer complete flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTIF1</name>
              <description>Channel x half transfer flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEIF1</name>
              <description>Channel x transfer error flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF2</name>
              <description>Channel x global interrupt flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIF2</name>
              <description>Channel x transfer complete flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTIF2</name>
              <description>Channel x half transfer flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEIF2</name>
              <description>Channel x transfer error flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF3</name>
              <description>Channel x global interrupt flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIF3</name>
              <description>Channel x transfer complete flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTIF3</name>
              <description>Channel x half transfer flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEIF3</name>
              <description>Channel x transfer error flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF4</name>
              <description>Channel x global interrupt flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIF4</name>
              <description>Channel x transfer complete flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTIF4</name>
              <description>Channel x half transfer flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEIF4</name>
              <description>Channel x transfer error flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF5</name>
              <description>Channel x global interrupt flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIF5</name>
              <description>Channel x transfer complete flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTIF5</name>
              <description>Channel x half transfer flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEIF5</name>
              <description>Channel x transfer error flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF6</name>
              <description>Channel x global interrupt flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIF6</name>
              <description>Channel x transfer complete flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTIF6</name>
              <description>Channel x half transfer flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEIF6</name>
              <description>Channel x transfer error flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF7</name>
              <description>Channel x global interrupt flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIF7</name>
              <description>Channel x transfer complete flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTIF7</name>
              <description>Channel x half transfer flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEIF7</name>
              <description>Channel x transfer error flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF8</name>
              <description>Channel x global interrupt flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIF8</name>
              <description>Channel x transfer complete flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTIF8</name>
              <description>Channel x half transfer flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEIF8</name>
              <description>Channel x transfer error flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
