yul78/STM32H723ZGT6_ROV/MDK-ARM/.pack/Keil/STM32H7xx_DFP.4.1.0/CMSIS/SVD/STM32H7B3.svd
        <register>
          <name>BDMA_CCR5</name>
          <displayName>BDMA_CCR5</displayName>
          <description>DMA channel x configuration
          register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>Channel enable This bit is set and
              cleared by software.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer complete interrupt enable This
              bit is set and cleared by software.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTIE</name>
              <description>Half transfer interrupt enable This bit
              is set and cleared by software.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer error interrupt enable This bit
              is set and cleared by software.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIR</name>
              <description>Data transfer direction This bit is set
              and cleared by software.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CIRC</name>
              <description>Circular mode This bit is set and
              cleared by software.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PINC</name>
              <description>Peripheral increment mode This bit is
              set and cleared by software.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MINC</name>
              <description>Memory increment mode This bit is set
              and cleared by software.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PSIZE</name>
              <description>Peripheral size These bits are set and
              cleared by software.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MSIZE</name>
              <description>Memory size These bits are set and
              cleared by software.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PL</name>
              <description>Channel priority level These bits are
              set and cleared by software.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>Memory to memory mode This bit is set
              and cleared by software.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BDMA_CNDTR5</name>
          <displayName>BDMA_CNDTR5</displayName>
          <description>DMA channel x number of data
          register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NDT</name>
              <description>Number of data to transfer Number of
              data to be transferred (0 up to 65535). This register
              can only be written when the channel is disabled.
              Once the channel is enabled, this register is
              read-only, indicating the remaining bytes to be
              transmitted. This register decrements after each DMA
              transfer. Once the transfer is completed, this
              register can either stay at zero or be reloaded
              automatically by the value previously programmed if
              the channel is configured in auto-reload mode. If
              this register is zero, no transaction can be served
              whether the channel is enabled or not.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BDMA_CPAR5</name>
          <displayName>BDMA_CPAR5</displayName>
          <description>This register must not be written when the
          channel is enabled.</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PA</name>
              <description>Peripheral address Base address of the
              peripheral data register from/to which the data will
              be read/written. When PSIZE is 01 (16-bit), the PA[0]
              bit is ignored. Access is automatically aligned to a
              half-word address. When PSIZE is 10 (32-bit), PA[1:0]
              are ignored. Access is automatically aligned to a
              word address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BDMA_CM0AR5</name>
          <displayName>BDMA_CM0AR5</displayName>
          <description>This register must not be written when the
          channel is enabled.</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory address Base address of the
              memory area from/to which the data will be
              read/written. When MSIZE is 01 (16-bit), the MA[0]
              bit is ignored. Access is automatically aligned to a
              half-word address. When MSIZE is 10 (32-bit), MA[1:0]
              are ignored. Access is automatically aligned to a
              word address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BDMA_CCR6</name>
          <displayName>BDMA_CCR6</displayName>
          <description>DMA channel x configuration
          register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>Channel enable This bit is set and
              cleared by software.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer complete interrupt enable This
              bit is set and cleared by software.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTIE</name>
              <description>Half transfer interrupt enable This bit
              is set and cleared by software.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer error interrupt enable This bit
              is set and cleared by software.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIR</name>
              <description>Data transfer direction This bit is set
              and cleared by software.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CIRC</name>
              <description>Circular mode This bit is set and
              cleared by software.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PINC</name>
              <description>Peripheral increment mode This bit is
              set and cleared by software.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MINC</name>
              <description>Memory increment mode This bit is set
              and cleared by software.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PSIZE</name>
              <description>Peripheral size These bits are set and
              cleared by software.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MSIZE</name>
              <description>Memory size These bits are set and
              cleared by software.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PL</name>
              <description>Channel priority level These bits are
              set and cleared by software.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>Memory to memory mode This bit is set
              and cleared by software.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BDMA_CNDTR6</name>
          <displayName>BDMA_CNDTR6</displayName>
          <description>DMA channel x number of data
          register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NDT</name>
              <description>Number of data to transfer Number of
              data to be transferred (0 up to 65535). This register
              can only be written when the channel is disabled.
              Once the channel is enabled, this register is
              read-only, indicating the remaining bytes to be
              transmitted. This register decrements after each DMA
              transfer. Once the transfer is completed, this
              register can either stay at zero or be reloaded
              automatically by the value previously programmed if
              the channel is configured in auto-reload mode. If
              this register is zero, no transaction can be served
              whether the channel is enabled or not.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BDMA_CPAR6</name>
          <displayName>BDMA_CPAR6</displayName>
          <description>This register must not be written when the
          channel is enabled.</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PA</name>
              <description>Peripheral address Base address of the
              peripheral data register from/to which the data will
              be read/written. When PSIZE is 01 (16-bit), the PA[0]
              bit is ignored. Access is automatically aligned to a
              half-word address. When PSIZE is 10 (32-bit), PA[1:0]
              are ignored. Access is automatically aligned to a
              word address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BDMA_CM0AR6</name>
          <displayName>BDMA_CM0AR6</displayName>
          <description>This register must not be written when the
          channel is enabled.</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory address Base address of the
              memory area from/to which the data will be
              read/written. When MSIZE is 01 (16-bit), the MA[0]
              bit is ignored. Access is automatically aligned to a
              half-word address. When MSIZE is 10 (32-bit), MA[1:0]
              are ignored. Access is automatically aligned to a
              word address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BDMA_CCR7</name>
          <displayName>BDMA_CCR7</displayName>
          <description>DMA channel x configuration
          register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>Channel enable This bit is set and
              cleared by software.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer complete interrupt enable This
              bit is set and cleared by software.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTIE</name>
              <description>Half transfer interrupt enable This bit
              is set and cleared by software.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer error interrupt enable This bit
              is set and cleared by software.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIR</name>
              <description>Data transfer direction This bit is set
              and cleared by software.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CIRC</name>
              <description>Circular mode This bit is set and
              cleared by software.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PINC</name>
              <description>Peripheral increment mode This bit is
              set and cleared by software.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MINC</name>
              <description>Memory increment mode This bit is set
              and cleared by software.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PSIZE</name>
              <description>Peripheral size These bits are set and
              cleared by software.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MSIZE</name>
              <description>Memory size These bits are set and
              cleared by software.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PL</name>
              <description>Channel priority level These bits are
              set and cleared by software.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>Memory to memory mode This bit is set
              and cleared by software.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BDMA_CNDTR7</name>
          <displayName>BDMA_CNDTR7</displayName>
          <description>DMA channel x number of data
          register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NDT</name>
              <description>Number of data to transfer Number of
              data to be transferred (0 up to 65535). This register
              can only be written when the channel is disabled.
              Once the channel is enabled, this register is
              read-only, indicating the remaining bytes to be
              transmitted. This register decrements after each DMA
              transfer. Once the transfer is completed, this
              register can either stay at zero or be reloaded
              automatically by the value previously programmed if
              the channel is configured in auto-reload mode. If
              this register is zero, no transaction can be served
              whether the channel is enabled or not.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BDMA_CPAR7</name>
          <displayName>BDMA_CPAR7</displayName>
          <description>This register must not be written when the
          channel is enabled.</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PA</name>
              <description>Peripheral address Base address of the
              peripheral data register from/to which the data will
              be read/written. When PSIZE is 01 (16-bit), the PA[0]
              bit is ignored. Access is automatically aligned to a
              half-word address. When PSIZE is 10 (32-bit), PA[1:0]
              are ignored. Access is automatically aligned to a
              word address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BDMA_CM0AR7</name>
          <displayName>BDMA_CM0AR7</displayName>
          <description>This register must not be written when the
          channel is enabled.</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory address Base address of the
              memory area from/to which the data will be
              read/written. When MSIZE is 01 (16-bit), the MA[0]
              bit is ignored. Access is automatically aligned to a
              half-word address. When MSIZE is 10 (32-bit), MA[1:0]
              are ignored. Access is automatically aligned to a
              word address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BDMA_CM1AR0</name>
          <displayName>BDMA_CM1AR0</displayName>
          <description>This register must not be written when the
          channel is enabled</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>BDMA_CM1AR1</name>
          <displayName>BDMA_CM1AR1</displayName>
          <description>BDMA_CMAR1</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>BDMA_CM1AR2</name>
          <displayName>BDMA_CM1AR2</displayName>
          <description>BDMA_CM1AR2</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>BDMA_CM1AR3</name>
          <displayName>BDMA_CM1AR3</displayName>
          <description>BDMA_CMAR3</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>BDMA_CM1AR4</name>
          <displayName>BDMA_CM1AR4</displayName>
          <description>BDMA_CM1AR4</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>BDMA_CM1AR5</name>
          <displayName>BDMA_CM1AR5</displayName>
          <description>This register must not be written when the
          channel is enabled.</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>BDMA_CM1AR6</name>
          <displayName>BDMA_CM1AR6</displayName>
          <description>This register must not be written when the
          channel is enabled.</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>BDMA_CM1AR7</name>
          <displayName>BDMA_CM1AR7</displayName>
          <description>This register must not be written when the
          channel is enabled.</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
