yul78/STM32H723ZGT6_ROV/MDK-ARM/.pack/Keil/STM32H7xx_DFP.4.1.0/CMSIS/SVD/STM32H7B3.svd
		  <register>
			  <name>FLASH_OPTSR_CUR_</name>
			  <displayName>FLASH_OPTSR_CUR_</displayName>
			  <description>FLASH option status register</description>
			  <addressOffset>0x11C</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>OPT_BUSY</name>
				  <description>Option byte change ongoing
				  flag</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>BOR_LEV</name>
				  <description>Brownout level option status
				  bit</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>2</bitWidth>
				</field>
				<field>
				  <name>IWDG_SW</name>
				  <description>IWDG1 control option status
				  bit</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>NRST_STOP</name>
				  <description>D1 DStop entry reset option status
				  bit</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>NRST_STDY</name>
				  <description>D1 DStandby entry reset option status
				  bit</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>RDP</name>
				  <description>Readout protection level option status
				  byte</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>8</bitWidth>
				</field>
				<field>
				  <name>VDDMMC_HSLV</name>
				  <description>IWDG Stop mode freeze option status
				  bit</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>WDG_FZ_STOP</name>
				  <description>IWDG Stop mode freeze option status
				  bit</description>
				  <bitOffset>17</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>IWDG_FZ_SDBY</name>
				  <description>IWDG Standby mode freeze option status
				  bit</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>ST_RAM_SIZE</name>
				  <description>DTCM RAM size option
				  status</description>
				  <bitOffset>19</bitOffset>
				  <bitWidth>2</bitWidth>
				</field>
				<field>
				  <name>SECURITY</name>
				  <description>Security enable option status
				  bit</description>
				  <bitOffset>21</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>								
				<field>
				  <name>VDDIO_HSLV</name>
				  <description>I/O high-speed at low-voltage status bit
				  (PRODUCT_BELOW_25V)</description>
				  <bitOffset>29</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>OPTCHANGEERR</name>
				  <description>Option byte change error
				  flag</description>
				  <bitOffset>30</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>SWAP_BANK_OPT</name>
				  <description>Bank swapping option status
				  bit</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
			  </fields>
          </register>
          <register>
          <name>FLASH_OPTSR_PRG_</name>
          <displayName>FLASH_OPTSR_PRG_</displayName>
          <description>FLASH option status register</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
				<field>
				  <name>BOR_LEV</name>
				  <description>BOR reset level option configuration
				  bits</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>2</bitWidth>
				</field>
				<field>
				  <name>IWDG_SW</name>
				  <description>IWDG1 option configuration
				  bit</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>NRST_STOP</name>
				  <description>Option byte erase after D1 DStop option
				  configuration bit</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>NRST_STDY</name>
				  <description>Option byte erase after D1 DStandby
				  option configuration bit</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>RDP</name>
				  <description>Readout protection level option
				  configuration byte</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>8</bitWidth>
				</field>
				<field>
				  <name>VDDMMC_HSLV</name>
				  <description>VDDMMC_HSLV</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>			
				<field>
				  <name>WDG_FZ_STOP</name>
				  <description>IWDG Stop mode freeze option
				  configuration bit</description>
				  <bitOffset>17</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>IWDG_FZ_SDBY</name>
				  <description>IWDG Standby mode freeze option
				  configuration bit</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>ST_RAM_SIZE</name>
				  <description>DTCM size select option configuration
				  bits</description>
				  <bitOffset>19</bitOffset>
				  <bitWidth>2</bitWidth>
				</field>
				<field>
				  <name>SECURITY</name>
				  <description>Security option configuration
				  bit</description>
				  <bitOffset>21</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>								
				<field>
				  <name>VDDIO_HSLV</name>
				  <description>VDDIO_HSLV</description>
				  <bitOffset>29</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>SWAP_BANK_OPT</name>
				  <description>Bank swapping option configuration
				  bit</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
			  </fields>
          </register>	
          <register>
          <name>FLASH_OPTCCR_</name>
          <displayName>FLASH_OPTCCR_</displayName>
          <description>FLASH option clear control
          register</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLR_OPTCHANGEERR</name>
              <description>OPTCHANGEERR reset bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>	  
          <register>
            <name>FLASH_PRAR_CUR2</name>
            <displayName>FLASH_PRAR_CUR2</displayName>
            <description>FLASH protection address for bank 2 </description>
            <addressOffset>0x128</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000F000</resetMask>
            <fields>
              <field>
                <name>PROT_AREA_START2</name>
                <description>Bank 2 PCROP area start status bits
These bits contain the first 256-byte block of the PCROP area in bank 2.
If this address is equal to PROT_AREA_END2, the whole bank 2 is PCROP protected.
If this address is higher than PROT_AREA_END2, no protection is set on bank 2.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PROT_AREA_END2</name>
                <description>Bank 2 PCROP area end status bits
These bits contain the last 256-byte block of the PCROP area in bank 2.
If this address is equal to PROT_AREA_START2, the whole bank 2 is PCROP protected.
If this address is lower than PROT_AREA_START2, no protection is set on bank 2.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DMEP2</name>
                <description>Bank 2 PCROP protected erase enable option status bit
If DMEP2 is set to 1, the PCROP protected area in bank 2 is erased when a protection level regression (change from level 1 to 0) or a bank erase with protection removal occurs.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_PRAR_PRG2</name>
            <displayName>FLASH_PRAR_PRG2</displayName>
            <description>FLASH protection address for bank 2 </description>
            <addressOffset>0x12c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000F000</resetMask>
            <fields>
              <field>
                <name>PROT_AREA_START2</name>
                <description>Bank 2 PCROP area start configuration bits
These bits contain the first 256-byte block of the PCROP area in bank 2.
If this address is equal to PROT_AREA_END2, the whole bank 2 is PCROP protected.
If this address is higher than PROT_AREA_END2, no protection is set on bank 2.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PROT_AREA_END2</name>
                <description>Bank 2 PCROP area end configuration bits
These bits contain the last 256-byte block of the PCROP area in bank 2.
If this address is equal to PROT_AREA_START2, the whole bank 2 is PCROP protected.
If this address is lower than PROT_AREA_START2, no protection is set on bank 2.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DMEP2</name>
                <description>Bank 2 PCROP protected erase enable option configuration bit
If DMEP2 is set to 1, the PCROP protected area in bank 2 is erased when a protection level regression (change from level 1 to 0) or a bank erase with protection removal occurs.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_SCAR_CUR2</name>
            <displayName>FLASH_SCAR_CUR2</displayName>
            <description>FLASH secure address for bank 2 </description>
            <addressOffset>0x130</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000F000</resetMask>
            <fields>
              <field>
                <name>SEC_AREA_START2</name>
                <description>Bank 2 secure-only area start status bits
These bits contain the first 256-byte block of the secure-only area in bank 2.
If this address is equal to SEC_AREA_END2, the whole bank 2 is secure protected.
If this address is higher than SEC_AREA_END2, no protection is set on bank 2.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>SEC_AREA_END2</name>
                <description>Bank 2 secure-only area end status bits
These bits contain the last 256-byte block of the secure-only area in bank 2.
If this address is equal to SEC_AREA_START2, the whole bank 2 is secure protected.
If this address is lower than SEC_AREA_START2, no protection is set on bank 2.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DMES2</name>
                <description>Bank 2 secure protected erase enable option status bit
If DMES2 is set to 1, the secure protected area in bank 2 is erased when a protection level regression (change from level 1 to 0) or a bank erase with protection removal occurs.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_SCAR_PRG2</name>
            <displayName>FLASH_SCAR_PRG2</displayName>
            <description>FLASH secure address for bank 2 </description>
            <addressOffset>0x134</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000F000</resetMask>
            <fields>
              <field>
                <name>SEC_AREA_START2</name>
                <description>Bank 2 secure-only area start configuration bits
These bits contain the first of 256 bytes block of the secure-only area in bank 2.
If this address is equal to SEC_AREA_END2, the whole bank 2 is secure access only.
If this address is higher than SEC_AREA_END2, no protection is set on bank 2.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SEC_AREA_END2</name>
                <description>Bank 2 secure-only area end configuration bits
These bits contain the last of 256 bytes block of the secure-only area in bank 2.
If this address is equal to SEC_AREA_START2, the whole bank 2 is secure access only.
If this address is lower than SEC_AREA_START2, no protection is set on bank 2.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DMES2</name>
                <description>Bank 2 secure access protected erase enable option configuration bit
If DMES2 is set to 1, the secure access only area in bank 2 is erased when a protection level regression (change from level 1 to 0) or a bank erase with protection removal occurs.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_WPSGN_CUR2R</name>
            <displayName>FLASH_WPSGN_CUR2R</displayName>
            <description>FLASH write sector group protection for bank 2	</description>
            <addressOffset>0x138</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>WRPSGn2</name>
                <description>Bank 2 sector group protection option status byte
Each FLASH_WPSGN_CUR2R bit reflects the write protection status of the corresponding group of 4 consecutive sectors in bank 2 (0: group is write protected; 1: group is not write protected)
Bit 0: Group embedding sectors 0 to 3
Bit 1: Group embedding sectors 4 to 7
Bit N: Group embedding sectors 4 x N to 4 x N + 3
Bit 31: Group embedding sectors 124 to 127
Note: Bank 2 is limited to 64 sectors on STM32H7A3xG devices.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_WPSGN_PRG2R</name>
            <displayName>FLASH_WPSGN_PRG2R</displayName>
            <description>FLASH write sector group protection for bank 2	</description>
            <addressOffset>0x13c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>WRPSGn2</name>
                <description>Bank 2 sector group protection option status byte
Setting WRPSGn2 bits to 0 write protects the corresponding group of 4 consecutive sectors in bank 2 (0: group is write protected; 1: group is not write protected)
Bit 0: Group embedding sectors 0 to 3
Bit 1: Group embedding sectors 4 to 7
Bit N: Group embedding sectors 4 x N to 4 x N + 3
Bit 31: Group embedding sectors 124 to 127
Note: Bank 2 is limited to 64 sectors on STM32H7A3xG devices.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
		  <register>
          <name>FLASH_BOOT_CURR_</name>
          <displayName>FLASH_BOOT_CURR_</displayName>
          <description>FLASH register with boot
          address</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOT_ADD0</name>
              <description>Boot address 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>BOOT_ADD1</name>
              <description>Boot address 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
          </register>
          <register>
			  <name>FLASH_BOOT_PRGR_</name>
			  <displayName>FLASH_BOOT_PRGR_</displayName>
			  <description>FLASH register with boot
			  address</description>
			  <addressOffset>0x144</addressOffset>
			  <size>0x20</size>
			  <access>read-only</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>BOOT_ADD0</name>
				  <description>Boot address 0</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>16</bitWidth>
				</field>
				<field>
				  <name>BOOT_ADD1</name>
				  <description>Boot address 1</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>16</bitWidth>
				</field>
			  </fields>
        </register>	
